title: Telegram Data Exfiltration via CLI (Braodo Stealer)
id: braodo-telegram-exfil
description: Detects outbound exfiltration via api.telegram.org in command-line context
author: Cyber Graf
status: experimental
license: CC BY 4.0

logsource:
  product: windows
  category: process_creation

detection:
  selection:
    CommandLine|contains:
      - 'api.telegram.org/bot'
      - 'sendDocument'
  condition: selection
level: high
tags:
  - T1041
  - Exfiltration
  - Telegram
  - Braodo
  - ANYRUN
