title: Batavia Spyware Activity - PowerShell & Persistence
id: batavia-spyware-2025
description: Detects PowerShell usage linked to Batavia spyware, including exfil and self-delete behavior
author: Cyber Graf
status: experimental
license: CC BY 4.0
reference: https://securelist.ru/batavia-apt-2025/

logsource:
  product: windows
  category: process_creation

detection:
  selection_1:
    Image|endswith: '\powershell.exe'
    CommandLine|contains:
      - 'Invoke-WebRequest'
      - 'ftp.exe'
      - 'curl'
  selection_2:
    CommandLine|contains:
      - 'cmd.exe /c del'
      - 'HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run'
  condition: 1 of selection_*
level: high

tags:
  - batavia
  - spyware
  - powershell
  - T1059.001
  - T1027
  - T1547.001
  - ThreatIntel