title: PaperWerewolf_Phishing_RAR_Execution
id: 8bce0baf-cdb1-4b07-9e39-18e97bcf74e5
description: Detects execution of WinRAR to extract malicious archive minprom_04072025.rar used by Paper Werewolf
author: Cyber Graf
status: experimental
license: CC BY 4.0

logsource:
  product: windows
  category: process_creation

detection:
  selection:
    Image|endswith: 
      - "\\WinRAR.exe"
      - "\\UnRAR.exe"
    CommandLine|contains:
      - "minprom_04072025.rar"

  condition: selection

level: high

tags:
  - attack.initial_access
  - attack.t1566.001
  - attack.t1204.002
  - paper_werewolf