title: FreeIPA Sudo Rule Modified to Allow All
id: ef57a093-d17c-4d54-95d7-e3d25c39b3de
description: Detects when a Sudo rule is modified to allow all commands and users
author: Cyber Graf
status: experimental
license: CC BY 4.0

logsource:
  category: apache2
  product: linux

detection:
  selection:
    Message|contains|all:
      - "sudorule_mod"
      - "usercategory='all'"
      - "hostcategory='all'"
      - "cmdcategory='all'"
  condition: selection

level: high

tags:
  - attack.privilege_escalation
  - sudo
  - freeipa
  - api_log