title: FreeIPA Roasting Attempt via AS_REQ Preauth Failures
id: 1e7c1b3c-61e4-4f1f-a34e-c6af6e123efa
description: Detects Kerberos AS_REQ spraying to gather salts for offline password attacks (CVE-2024-3183)
author: Cyber Graf
status: experimental
license: CC BY 4.0

logsource:
  category: kerberos
  product: linux

detection:
  selection:
    EventID|contains: "AS_REQ"
    Message|contains: "PREAUTH_FAILED"
  timeframe: 5m
  condition: selection | count(usr_tgt_fullname) > 5

level: high

tags:
  - attack.credential_access
  - attack.t1558.003
  - kerberos
  - freeipa
  - CVE-2024-3183