title: Room155 Suspicious Double Extension Executable
id: a5c0cbb2-9c12-42de-a33d-room155-pdfexe
description: Detect execution of suspicious file with double extension used by room155
author: Cyber Graf
status: experimental
license: CC BY 4.0

logsource:
  category: process_creation
  product: windows

detection:
  selection:
    Image|endswith: 
      - '.pdf.exe'
      - '.pdf.scr'
      - '.xlsx.scr'
      - '.xsl.scr'
      - '.docx.scr'
      - '.doc.scr'
  condition: selection

level: medium

tags:
  - attack.defense_evasion
  - attack.t1036
  - room155